tap "felixkratz/formulae"
tap "grishka/grishka"
tap "nikitabobko/tap"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "readline"
brew "bash"
brew "openssl@3"
brew "bat"
brew "bison"
brew "btop"
brew "cairo"
brew "cmake"
brew "coreutils"
brew "dua-cli"
brew "emojify"
brew "exiftool"
brew "exiv2"
brew "eza"
brew "fd"
brew "unbound"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libmicrohttpd"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "ghostscript"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "hdf5"
brew "libheif"
brew "liblqr"
brew "libraw"
brew "imagemagick"
brew "lazydocker"
brew "libffi"
brew "libpq"
brew "libyaml"
brew "luarocks"
brew "neovim"
brew "node"
brew "nvm"
brew "podman"
brew "podman-compose"
brew "premake"
brew "pyqt"
brew "qpdf"
brew "qt"
brew "ripgrep"
brew "ruby-install"
brew "stow"
brew "thefuck"
brew "tlrc"
brew "uv"
brew "wakeonlan"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "xdelta"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "aerospace"
cask "betterdisplay"
cask "blackhole-2ch"
cask "copyq"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "gimp@dev"
cask "localsend"
cask "macfuse"
cask "sf-symbols"
cask "swiftformat-for-xcode"
cask "warp"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "anysphere.remote-ssh"
vscode "asvetliakov.vscode-neovim"
vscode "charliermarsh.ruff"
vscode "docker.docker"
vscode "elazarcoh.simply-view-image-for-python-debugging"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "illixion.vscode-vibrancy-continued"
vscode "jock.svg"
vscode "k--kato.intellij-idea-keybindings"
vscode "malcolmmielle.semantic-highlighting"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.datawrangler"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.remote-repositories"
vscode "samuelcolvin.jinjahtml"
vscode "sswg.swift-lang"
vscode "tamasfe.even-better-toml"
vscode "vadimcn.vscode-lldb"
vscode "waderyan.gitblame"
