tap "felixkratz/formulae"
tap "grishka/grishka"
tap "nikitabobko/tap"
brew "xz"
brew "libtiff"
brew "little-cms2"
brew "webp"
brew "jpeg-xl"
brew "aom"
brew "automake"
brew "readline"
brew "bash"
brew "openssl@3"
brew "bat"
brew "bison"
brew "btop"
brew "cairo"
brew "clang-format"
brew "cmake"
brew "coreutils"
brew "dos2unix"
brew "dua-cli"
brew "duti"
brew "emojify"
brew "exiftool"
brew "exiv2"
brew "eza"
brew "fastfetch"
brew "fd"
brew "unbound"
brew "harfbuzz"
brew "openjpeg"
brew "leptonica"
brew "libmicrohttpd"
brew "librist"
brew "tesseract"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "ghostscript"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "hdf5"
brew "hidapi"
brew "libheif"
brew "liblqr"
brew "libraw"
brew "imagemagick"
brew "lazydocker"
brew "libffi"
brew "libpq"
brew "libusb"
brew "libyaml"
brew "luarocks"
brew "make"
brew "neovim"
brew "node"
brew "nvm"
brew "pnpm"
brew "podman"
brew "podman-compose"
brew "premake"
brew "pyqt"
brew "qpdf"
brew "qt"
brew "ripgrep"
brew "ruby-install"
brew "stow"
brew "swift-format"
brew "swiftlint"
brew "switchaudio-osx"
brew "thefuck"
brew "tlrc"
brew "uv"
brew "wakeonlan"
brew "wget"
brew "xcbeautify"
brew "xcode-build-server"
brew "xcodegen"
brew "xdelta"
brew "yt-dlp"
brew "zoxide"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "nikitabobko/tap/aerospace"
cask "betterdisplay"
cask "blackhole-2ch"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
cask "gimp@dev"
cask "iina"
cask "keycastr"
cask "localsend"
cask "macfuse"
cask "sf-symbols"
cask "swiftformat-for-xcode"
cask "iterm2"
